NordicPlayground/nrf52-gtt-demos/02_twi_easydma_list/nrf_drv_twi_mod_.c
    p_cb->state = NRF_DRV_STATE_INITIALIZED;

    return NRF_SUCCESS;
}

void nrf_drv_twi_uninit(nrf_drv_twi_t const * p_instance)
{
    twi_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    ASSERT(p_cb->state != NRF_DRV_STATE_UNINITIALIZED);

    if (p_cb->handler)
    {
        nrf_drv_common_irq_disable(nrf_drv_get_IRQn(p_instance->p_reg));
    }
    nrf_drv_twi_disable(p_instance);

    p_cb->state = NRF_DRV_STATE_UNINITIALIZED;
}

void nrf_drv_twi_enable(nrf_drv_twi_t const * p_instance)
{
    twi_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    ASSERT(p_cb->state == NRF_DRV_STATE_INITIALIZED);

    CODE_FOR_TWIM
    (
        NRF_TWIM_Type * p_twim = p_instance->p_reg;

        nrf_twim_enable(p_twim);
    )
    CODE_FOR_TWI
    (
        NRF_TWI_Type * p_twi = p_instance->p_reg;

        nrf_twi_enable(p_twi);
    )

    p_cb->state = NRF_DRV_STATE_POWERED_ON;
}

void nrf_drv_twi_disable(nrf_drv_twi_t const * p_instance)
{
    twi_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    ASSERT(p_cb->state != NRF_DRV_STATE_UNINITIALIZED);

    CODE_FOR_TWIM
    (
        NRF_TWIM_Type * p_twim = p_instance->p_reg;
        p_cb->int_mask = 0;
        nrf_twim_int_disable(p_twim, DISABLE_ALL);
        nrf_twim_shorts_disable(p_twim, DISABLE_ALL);
        nrf_twim_disable(p_twim);
    )
    CODE_FOR_TWI
    (
        NRF_TWI_Type * p_twi = p_instance->p_reg;
        nrf_twi_int_disable(p_twi, DISABLE_ALL);
        nrf_twi_shorts_disable(p_twi, DISABLE_ALL);
        nrf_twi_disable(p_twi);
    )

    p_cb->state = NRF_DRV_STATE_INITIALIZED;
}

//#define TWI_IN_USE
#ifdef TWI_IN_USE

static bool twi_send_byte(NRF_TWI_Type * p_twi, twi_control_block_t * p_cb)//nrf_drv_twi_xfer_desc_t * p_desc, uint8_t * p_bytes_transferred)
{
#if 0
    if (*p_bytes_transferred < p_desc->primary_length)
    {
        nrf_twi_txd_set(p_twi, p_desc->p_primary_buf[*p_bytes_transferred]);
        ++(*p_bytes_transferred);
    }
    else if (*p_bytes_transferred == p_desc->primary_length)
    {
        if (p_desc->type != NRF_DRV_TWI_XFER_TX /* flag no stop */)
        {
            nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_SUSPEND);
            return false;
        }
        else
        {
            nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STOP);
        }
    }
    else if (*p_bytes_transferred < (p_desc->primary_length + p_desc->secondary_length))
    {
        nrf_twi_txd_set(p_twi, p_desc->p_secondary_buf[*p_bytes_transferred - p_desc->primary_length]);
        ++(*p_bytes_transferred);
    }
    else
    {
        nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STOP);
    }

#endif
    return true;
}

static void twi_receive_byte(NRF_TWI_Type * p_twi, twi_control_block_t * p_cb)
{
    return;
#if 0
    if (p_cb->bytes_transferred < p_cb->xfer.length)
    {
        p_cb->xfer.p_data[p_cb->bytes_transferred] = nrf_twi_rxd_get(p_twi);

        ++(p_cb->bytes_transferred);

        if (p_cb->bytes_transferred == p_cb->xfer.length-1)
        {
            nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_STOP_MASK);
        }
        else if (p_cb->bytes_transferred == p_cb->xfer.length)
        {
            return;
        }

        nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_RESUME);
    }
#endif
}

static bool twi_transfer(NRF_TWI_Type * p_twi, twi_control_block_t * p_cb)
{
    bool do_stop_check;

    if ((p_cb->error == true) || (p_cb->bytes_transferred == p_cb->xfer.length))
    {
        do_stop_check = true;
    }
    else
    {
        do_stop_check = false;
    }

    if (p_cb->error)
    {
        nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_ERROR);
        nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_TXDSENT);
        nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_RXDREADY);
    }
    else if (nrf_twi_event_check(p_twi, NRF_TWI_EVENT_ERROR))
    {
        nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_ERROR);
        nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STOP);
        p_cb->error = true;
    }
    else
    {
        if (nrf_twi_event_check(p_twi, NRF_TWI_EVENT_TXDSENT))
        {
            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_TXDSENT);
            if (nrf_twi_event_check(p_twi, NRF_TWI_EVENT_ERROR))
            {
                nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_ERROR);
                nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STOP);
                p_cb->error = true;
            }
            else
            {
                if (p_cb->xfer.tx && !twi_send_byte(p_twi, p_cb))
                {
                    return false;
                }
            }
        }
        else if (nrf_twi_event_check(p_twi, NRF_TWI_EVENT_RXDREADY))
        {
            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_RXDREADY);
            if (nrf_twi_event_check(p_twi, NRF_TWI_EVENT_ERROR))
            {
                nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_ERROR);
                nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STOP);
                p_cb->error = true;
            }
            else
            {
                twi_receive_byte(p_twi, p_cb);
            }
        }
    }

    if (do_stop_check && nrf_twi_event_check(p_twi, NRF_TWI_EVENT_STOPPED))
    {
        nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_STOPPED);
        return false;
    }

    return true;
}
#endif // TWI_IN_USE

#if 0
static ret_code_t start_transfer(twi_control_block_t * p_cb,
                                 void *                p_reg,
                                 uint8_t               address,
                                 uint8_t const *       p_data,
                                 uint8_t               length,
                                 bool                  no_stop,
                                 bool                  tx)
{
    ASSERT(p_cb->state == NRF_DRV_STATE_POWERED_ON);

    ASSERT(p_data != NULL);
    ASSERT(length > 0);

    // Currently we don't support repeated starts after a read transfer.
    if (no_stop && !tx)
    {
        return NRF_ERROR_NOT_SUPPORTED;
    }

    CODE_FOR_TWIM
    (
        if (!nrf_drv_is_in_RAM(p_data))
        {
            return NRF_ERROR_INVALID_ADDR;
        }
    )
    CODE_FOR_TWI
    (
    )

    bool is_busy = false;
    bool is_linked = false;
    volatile twi_xfer_req_t * p_xfer = &p_cb->xfer;

    /* Block TWI interrupts to ensure that function is not interrupted by TWI interrupt. */
    CODE_FOR_TWIM
    (
        NRF_TWIM_Type * p_twim = (NRF_TWIM_Type *)p_reg;
        nrf_twim_int_disable(p_twim, DISABLE_ALL);
    )
    CODE_FOR_TWI
    (
        NRF_TWI_Type * p_twi = (NRF_TWI_Type *)p_reg;
        nrf_twi_int_disable(p_twi, DISABLE_ALL);
    )

