NordicPlayground/nrf52-gtt-demos/02_twi_easydma_list/nrf_drv_twi_mod_.c
    if (p_cb->xfer.p_data)
    {
        if (p_cb->handler)
        {
            if (p_cb->next_xfer.p_data)
            {
                is_busy = true;
            }
            else
            {
                p_xfer = &p_cb->next_xfer;
                is_linked = true;
            }
        }
        else
        {
            is_busy = true;
        }
    }
    if (!is_busy)
    {
        p_xfer->p_data =  (uint8_t *)p_data;
        p_cb->repeated = false;
        p_cb->txrx     = false;
    }
    else if (is_busy)
    {
        /* It driver is busy re-enable interrupts and return. */
        CODE_FOR_TWIM
        (
            NRF_TWIM_Type * p_twim = (NRF_TWIM_Type *)p_reg;
            nrf_twim_int_enable(p_twim, p_cb->int_mask);
        )
        CODE_FOR_TWI
        (
            NRF_TWI_Type * p_twi = (NRF_TWI_Type *)p_reg;
            nrf_twi_int_enable(p_twi, p_cb->int_mask);
        )
        return NRF_ERROR_BUSY;
    }

    p_xfer->address = address;
    p_xfer->length  = length;
    p_xfer->no_stop = no_stop;
    p_xfer->tx      = tx;

    p_cb->error   = false;

    ret_code_t ret_code = NRF_SUCCESS;

    CODE_FOR_TWIM
    (
        NRF_TWIM_Type * p_twim = (NRF_TWIM_Type *)p_reg;

        if (!p_cb->handler)
        {
            nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_STOPPED);
            nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
            nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_ERROR);
        }

        nrf_twim_address_set(p_twim, address);
        if (tx)
        {
            if (!is_linked)
            {
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_TXSTARTED);
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_STOPPED);
                nrf_twim_tx_buffer_set(p_twim, p_data, length);

                nrf_twim_shorts_set(p_twim, (no_stop) ? NRF_TWIM_SHORT_LASTTX_SUSPEND_MASK :
                        NRF_TWIM_SHORT_LASTTX_STOP_MASK);
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTTX);

            }
            else
            {
                if (p_cb->xfer.tx)
                {
                    while(!nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_TXSTARTED))
                    {}
                }
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_TXSTARTED);
                nrf_twim_tx_buffer_set(p_twim, p_data, length);
            }

            p_cb->int_mask = (p_cb->xfer.no_stop) ? NRF_TWIM_INT_LASTTX_MASK | NRF_TWIM_INT_ERROR_MASK:
                                             NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;

        }
        else
        {
            if (!is_linked)
            {
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_RXSTARTED);
                nrf_twim_rx_buffer_set(p_twim, (uint8_t *)p_data, length);
                nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTRX_STOP_MASK);

                p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTRX);
            }
            else
            {
                //if previous transfer was rx pend until it's started.
                if (!p_cb->xfer.tx)
                {
                    while(!nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_RXSTARTED))
                    {}
                }
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_RXSTARTED);
                nrf_twim_rx_buffer_set(p_twim, (uint8_t *)p_data, length);

                if (p_cb->xfer.no_stop)
                {
                    p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK |
                               NRF_TWIM_INT_ERROR_MASK   |
                               NRF_TWIM_INT_LASTTX_MASK;
                    nrf_twim_shorts_enable(p_twim, NRF_TWIM_SHORT_LASTTX_STARTRX_MASK |
                                                   NRF_TWIM_SHORT_LASTRX_STOP_MASK);
                    if (nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_LASTTX))
                    {
                        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
                        nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
                        nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTRX);
                    }
                    nrf_twim_shorts_disable(p_twim, NRF_TWIM_SHORT_LASTTX_SUSPEND_MASK);
                }
                else
                {
                    p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK |
                               NRF_TWIM_INT_ERROR_MASK;
                }
            }
        }

        if (p_cb->handler)
        {
            nrf_twim_int_enable(p_twim, p_cb->int_mask);
        }
        else
        {
            nrf_twim_event_t event = (no_stop) ? NRF_TWIM_EVENT_LASTTX : NRF_TWIM_EVENT_STOPPED;

            while (!nrf_twim_event_check(p_twim, event))
            {
                if (nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_ERROR))
                {
                    nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_ERROR);
                    nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STOP);
                    event = NRF_TWIM_EVENT_STOPPED;
                }
            }

            uint32_t errorsrc =  nrf_twim_errorsrc_get_and_clear(p_twim);

            p_cb->xfer.p_data = NULL;

            if (errorsrc)
            {
                return NRF_ERROR_INTERNAL;
            }
        }
    )
    CODE_FOR_TWI
    (
        NRF_TWI_Type * p_twi = (NRF_TWI_Type *)p_reg;
        if (!is_linked)
        {


            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_STOPPED);
            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_ERROR);
            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_TXDSENT);
            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_RXDREADY);
            nrf_twi_shorts_set(p_twi, 0);

            p_cb->bytes_transferred = 0;

            nrf_twi_address_set(p_twi, address);

            // In case TWI is suspended resume its operation.
            nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_RESUME);

