NordicPlayground/nrf52-gtt-demos/02_twi_easydma_list/nrf_drv_twi_mod_.c
            if (tx)
            {
                nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTTX);
                (void)twi_send_byte(p_twi, p_cb);
            }
            else
            {
                if (p_cb->xfer.length == 1 && !p_cb->xfer.no_stop)
                {
                    nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_STOP_MASK);
                }
                else
                {
                    nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_SUSPEND_MASK);
                }
                nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTRX);
            }

            if (p_cb->handler)
            {
                p_cb->int_mask = NRF_TWI_INT_STOPPED_MASK   |
                                NRF_TWI_INT_ERROR_MASK     |
                                NRF_TWI_INT_TXDSENT_MASK   |
                                NRF_TWI_INT_RXDREADY_MASK;
                nrf_twi_int_enable(p_twi, p_cb->int_mask);
            }
            else
            {
                while (twi_transfer(p_twi, p_cb))
                {}

                if (p_cb->error)
                {
                    ret_code = NRF_ERROR_INTERNAL;
                }

                p_cb->xfer.p_data = NULL;
            }
        }
        else
        {
            p_cb->int_mask = NRF_TWI_INT_STOPPED_MASK   |
                            NRF_TWI_INT_ERROR_MASK     |
                            NRF_TWI_INT_TXDSENT_MASK   |
                            NRF_TWI_INT_RXDREADY_MASK;
            nrf_twi_int_enable(p_twi, p_cb->int_mask);
        }
    )

    return ret_code;
}
#endif
#if 0
static ret_code_t twi_tx_start_transfer(twi_control_block_t * p_cb,
                                        NRF_TWI_Type *        p_twi,
                                        uint8_t const *       p_data,
                                        uint8_t               length,
                                        bool                  no_stop)
{
    ret_code_t ret_code = NRF_SUCCESS;

    nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_STOPPED);
    nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_ERROR);
    nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_TXDSENT);
    nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_RXDREADY);
    nrf_twi_shorts_set(p_twi, 0);

    p_cb->bytes_transferred = 0;

    // In case TWI is suspended resume its operation.
    nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_RESUME);
    nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTTX);
    (void)twi_send_byte(p_twi, p_cb);


    if (p_cb->handler)
    {
        p_cb->int_mask = NRF_TWI_INT_STOPPED_MASK   |
                        NRF_TWI_INT_ERROR_MASK     |
                        NRF_TWI_INT_TXDSENT_MASK   |
                        NRF_TWI_INT_RXDREADY_MASK;
        nrf_twi_int_enable(p_twi, p_cb->int_mask);
    }
    else
    {
        while (twi_transfer(p_twi, p_cb))
        {}

        if (p_cb->error)
        {
            ret_code = NRF_ERROR_INTERNAL;
        }
    }
    return ret_code;
}

__STATIC_INLINE ret_code_t twi_xfer(nrf_drv_twi_t     const * p_instance,
                                     nrf_drv_twi_xfer_desc_t * p_xfer_desc,
                                     uint32_t                  flags)
{
    ret_code_t ret = NRF_SUCCESS;
    twi_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_TWI_Type  * p_twi = (NRF_TWI_Type *)p_instance->p_reg;

    /* Block TWI interrupts to ensure that function is not interrupted by TWI interrupt. */
    nrf_twim_int_disable(p_twi, DISABLE_ALL);

    if (p_cb->busy)
    {
        nrf_twim_int_enable(p_twi, p_cb->int_mask);
        return NRF_ERROR_BUSY;
    }
    else
    {
        p_cb->busy = (NRF_DRV_TWI_FLAGS_NO_XFER_EVT_HANDLER & flags) ? false: true;
    }

//    twi_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];

    nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_STOPPED);
    nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_ERROR);
    nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_TXDSENT);
    nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_RXDREADY);
    nrf_twi_shorts_set(p_twi, 0);

    p_cb->bytes_transferred = 0;

    nrf_twi_address_set(p_twi, p_xfer_desc->address);
    // In case TWI is suspended resume its operation.
    nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_RESUME);

    if (!(p_xfer_desc->type == NRF_DRV_TWI_XFER_RX))
    {
        nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTTX);
        (void)twi_send_byte(p_twi, p_cb);
    }
    else
    {
        if (p_xfer_desc->primary_length == 1)
        {
            nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_STOP_MASK);
        }
        else
        {
            nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_SUSPEND_MASK);
        }
        nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTRX);
    }
    if (p_cb->handler)
    {
        p_cb->int_mask = NRF_TWI_INT_STOPPED_MASK   |
                        NRF_TWI_INT_ERROR_MASK     |
                        NRF_TWI_INT_TXDSENT_MASK   |
                        NRF_TWI_INT_RXDREADY_MASK;
        nrf_twi_int_enable(p_twi, p_cb->int_mask);
    }
    else
    {
        while (twi_transfer(p_twi, p_cb))
        {}

        if (p_cb->error)
        {
            ret_code = NRF_ERROR_INTERNAL;
        }

        if (p_xfer_desc->type == NRF_DRV_TWI_XFER_TXTX)
        {
            //Continue with TX
            nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_RESUME);
            nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTTX);
            (void)twi_send_byte(p_twi, p_cb);
        }
        else if (p_xfer_desc->type == NRF_DRV_TWI_XFER_TXRX)
        {
            if (p_xfer_desc->secondary_length == 1)
            {
                nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_STOP_MASK);
            }
            else
            {
                nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_SUSPEND_MASK);
            }
            nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTRX);
        }


    }
    return ret;
}
#endif
__STATIC_INLINE ret_code_t twim_xfer(nrf_drv_twi_t     const * p_instance,
                                     nrf_drv_twi_xfer_desc_t * p_xfer_desc,
                                     uint32_t                  flags)
{
    ret_code_t ret = NRF_SUCCESS;
    twi_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_TWIM_Type  * p_twim = (NRF_TWIM_Type *)p_instance->p_reg;
    nrf_twim_task_t  start_task = NRF_TWIM_TASK_STARTTX;
    nrf_twim_event_t evt_to_wait = NRF_TWIM_EVENT_STOPPED;

    if (!nrf_drv_is_in_RAM(p_xfer_desc->p_primary_buf))
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    /* Block TWI interrupts to ensure that function is not interrupted by TWI interrupt. */
    nrf_twim_int_disable(p_twim, DISABLE_ALL);
    if (p_cb->busy)
    {
        nrf_twim_int_enable(p_twim, p_cb->int_mask);
        return NRF_ERROR_BUSY;
    }
    else
    {

        p_cb->busy = (NRF_DRV_TWI_FLAGS_NO_XFER_EVT_HANDLER & flags) ? false: true;
    }

    p_cb->xfer_desc = *p_xfer_desc;
    p_cb->repeated = (flags & NRF_DRV_TWI_FLAGS_REPEATED_XFER) ? true : false;
    nrf_twim_address_set(p_twim, p_xfer_desc->address);

    nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_STOPPED);
    nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_ERROR);
    switch (p_xfer_desc->type)
    {
    case NRF_DRV_TWI_XFER_TXTX:
        ASSERT(!(flags & NRF_DRV_TWI_FLAGS_REPEATED_XFER));
        ASSERT(!(flags & NRF_DRV_TWI_FLAGS_HOLD_XFER));
        ASSERT(!(flags & NRF_DRV_TWI_FLAGS_NO_XFER_EVT_HANDLER));
        if (!nrf_drv_is_in_RAM(p_xfer_desc->p_secondary_buf))
        {
            return NRF_ERROR_INVALID_ADDR;
        }
        nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_SUSPEND_MASK);
        nrf_twim_tx_buffer_set(p_twim, p_xfer_desc->p_primary_buf, p_xfer_desc->primary_length);
        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_TXSTARTED);
        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
        nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
        nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTTX);
        while(!nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_TXSTARTED))
        {}
        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_TXSTARTED);
        nrf_twim_tx_buffer_set(p_twim, p_xfer_desc->p_secondary_buf, p_xfer_desc->secondary_length);
        p_cb->int_mask = /*NRF_TWIM_INT_LASTTX_MASK*/(1 <<18) | NRF_TWIM_INT_ERROR_MASK;
        break;
    case NRF_DRV_TWI_XFER_TXRX:
        nrf_twim_tx_buffer_set(p_twim, p_xfer_desc->p_primary_buf, p_xfer_desc->primary_length);
        nrf_twim_rx_buffer_set(p_twim, p_xfer_desc->p_secondary_buf, p_xfer_desc->secondary_length);
        nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_STARTRX_MASK |
                                    NRF_TWIM_SHORT_LASTRX_STOP_MASK);
        p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;
        break;
    case NRF_DRV_TWI_XFER_TX:
        nrf_twim_tx_buffer_set(p_twim, p_xfer_desc->p_primary_buf, p_xfer_desc->primary_length);
        if (NRF_DRV_TWI_FLAGS_TX_NO_STOP & flags)
        {
            nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_SUSPEND_MASK);
            p_cb->int_mask = NRF_TWIM_INT_LASTTX_MASK | NRF_TWIM_INT_ERROR_MASK;
            nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
            evt_to_wait = NRF_TWIM_EVENT_LASTTX;
        }
        else
        {
            nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_STOP_MASK);
            p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;
        }
        nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
        break;
    case NRF_DRV_TWI_XFER_RX:
        nrf_twim_rx_buffer_set(p_twim, p_xfer_desc->p_primary_buf, p_xfer_desc->primary_length);
        nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTRX_STOP_MASK);
        p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;
        start_task = NRF_TWIM_TASK_STARTRX;
        nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
        break;
    default:
        ret = NRF_ERROR_INVALID_PARAM;
        break;
    }

    if (!(flags & NRF_DRV_TWI_FLAGS_HOLD_XFER) && (p_xfer_desc->type != NRF_DRV_TWI_XFER_TXTX))
    {
        nrf_twim_task_trigger(p_twim, start_task);
    }

    if (p_cb->handler)
    {
        if (flags & NRF_DRV_TWI_FLAGS_NO_XFER_EVT_HANDLER)
        {
            p_cb->int_mask = NRF_TWIM_INT_ERROR_MASK;
        }
        nrf_twim_int_enable(p_twim, p_cb->int_mask);
    }
    else
    {
        while (!nrf_twim_event_check(p_twim, evt_to_wait))
        {
            if (nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_ERROR))
            {
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_ERROR);
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STOP);
                evt_to_wait = NRF_TWIM_EVENT_STOPPED;
            }
        }

