NordicPlayground/nrf52-gtt-demos/02_twi_easydma_list/nrf_drv_twi_mod_.c
    nrf_drv_twi_evt_t event;
    event.xfer_desc.p_primary_buf = p_cb->xfer.p_data;
    event.xfer_desc.primary_length = p_cb->bytes_transferred;
    //event.data.tx     = p_cb->xfer.tx;

    if (p_cb->error)
    {
        uint32_t errorsrc = nrf_twi_errorsrc_get_and_clear(p_twi);
        if (errorsrc & NRF_TWI_ERROR_ADDRESS_NACK)
        {
            event.type = NRF_DRV_TWI_EVT_ADDRESS_NACK;
        }
        else if (errorsrc & NRF_TWI_ERROR_DATA_NACK)
        {
            event.type = NRF_DRV_TWI_EVT_DATA_NACK;
        }
    }
    else
    {
        event.type = NRF_DRV_TWI_EVT_DONE;
    }

    /* if linked transfer present schedule it.
     * Would be good to wrap it around critical section since now it can be interrupted by API called
     * from higher level interrupt. */
    p_cb->xfer.p_data = NULL;
    if (p_cb->next_xfer.p_data)
    {
        uint8_t * p_data = p_cb->next_xfer.p_data;
        uint8_t length   = p_cb->next_xfer.length;
        bool    no_stop  = p_cb->next_xfer.no_stop;
        bool    tx       = p_cb->next_xfer.tx;
        p_cb->next_xfer.p_data = NULL;
        //(void)start_transfer(p_cb, p_twi, p_cb->next_xfer.address, p_data, length, no_stop, tx);
    }
    p_cb->handler(&event, p_cb->p_context);
}
#endif // TWI_IN_USE

#if (TWI0_ENABLED == 1)
void TWI0_IRQ_HANDLER(void)
{
    #if (TWI0_USE_EASY_DMA == 1) && defined(NRF52)
        irq_handler_twim(NRF_TWIM0,
    #else
        irq_handler_twi(NRF_TWI0,
    #endif
            &m_cb[TWI0_INSTANCE_INDEX]);
}
#endif // (TWI0_ENABLED == 1)

#if (TWI1_ENABLED == 1)
void TWI1_IRQ_HANDLER(void)
{
    #if (TWI1_USE_EASY_DMA == 1)
        irq_handler_twim(NRF_TWIM1,
    #else
        irq_handler_twi(NRF_TWI1,
    #endif
            &m_cb[TWI1_INSTANCE_INDEX]);
}
#endif // (SPI1_ENABLED == 1)
